In [1]:
import warnings
warnings.simplefilter('ignore')

import numpy as np
import pandas as pd
import urllib
import requests
import json
import psycopg2
from sqlalchemy import create_engine

In [2]:
engine = create_engine('postgresql://yrustt:***@localhost:5432/superset')

# Movies

In [3]:
movies = pd.read_table('data/movies.dat', encoding='cp1251', index_col='id')
movies.head()

,title,imdbID,spanishTitle,imdbPictureURL,year,rtID,rtAllCriticsRating,rtAllCriticsNumReviews,rtAllCriticsNumFresh,rtAllCriticsNumRotten,rtAllCriticsScore,rtTopCriticsRating,rtTopCriticsNumReviews,rtTopCriticsNumFresh,rtTopCriticsNumRotten,rtTopCriticsScore,rtAudienceRating,rtAudienceNumRatings,rtAudienceScore,rtPictureURL
id,,,,,,,,,,,,,,,,,,,,
1,Toy story,114709,Toy story (juguetes),http://ia.media-imdb.com/images/M/MV5BMTMwNDU0...,1995,toy_story,9,73,73,0,100,8.5,17,17,0,100,3.7,102338,81,http://content7.flixster.com/movie/10/93/63/10...
2,Jumanji,113497,Jumanji,http://ia.media-imdb.com/images/M/MV5BMzM5NjE1...,1995,1068044-jumanji,5.6,28,13,15,46,5.8,5,2,3,40,3.2,44587,61,http://content8.flixster.com/movie/56/79/73/56...
3,Grumpy Old Men,107050,Dos viejos gruсones,http://ia.media-imdb.com/images/M/MV5BMTI5MTgy...,1993,grumpy_old_men,5.9,36,24,12,66,7,6,5,1,83,3.2,10489,66,http://content6.flixster.com/movie/25/60/25602...
4,Waiting to Exhale,114885,Esperando un respiro,http://ia.media-imdb.com/images/M/MV5BMTczMTMy...,1995,waiting_to_exhale,5.6,25,14,11,56,5.5,11,5,6,45,3.3,5666,79,http://content9.flixster.com/movie/10/94/17/10...
5,Father of the Bride Part II,113041,Vuelve el padre de la novia (Ahora tambiйn abu...,http://ia.media-imdb.com/images/M/MV5BMTg1NDc2...,1995,father_of_the_bride_part_ii,5.3,19,9,10,47,5.4,5,1,4,20,3,13761,64,http://content8.flixster.com/movie/25/54/25542...

In [4]:
movies.to_sql('movies', engine)

In [6]:
movie_genres = pd.read_table('data/movie_genres.dat', encoding='cp1251', index_col='movieID')
movie_genres.head()

             genre
movieID
1        Adventure
1        Animation
1         Children
1           Comedy
1          Fantasy

In [9]:
movie_genres.to_sql('movies_genres', engine)

In [10]:
movie_directors = pd.read_table('data/movie_directors.dat', encoding='cp1251', index_col='movieID')
movie_directors.head()

              directorID     directorName
movieID
1          john_lasseter    John Lasseter
2           joe_johnston     Joe Johnston
3          donald_petrie    Donald Petrie
4        forest_whitaker  Forest Whitaker
5          charles_shyer    Charles Shyer

In [11]:
movie_directors.to_sql('movie_directors', engine)

In [12]:
movie_actors = pd.read_table('data/movie_actors.dat', encoding='cp1251', index_col='movieID')
movie_actors.head()

                 actorID        actorName  ranking
movieID
1            annie_potts      Annie Potts       10
1            bill_farmer      Bill Farmer       20
1            don_rickles      Don Rickles        3
1        erik_von_detten  Erik von Detten       13
1              greg-berg        Greg Berg       17

In [13]:
movie_actors.to_sql('movie_actors', engine)

In [14]:
movie_countries = pd.read_table('data/movie_countries.dat', encoding='cp1251', index_col='movieID')
movie_countries.head()

        country
movieID
1           USA
2           USA
3           USA
4           USA
5           USA

In [15]:
movie_countries.to_sql('movie_countries', engine)

In [16]:
movie_locations = pd.read_table('data/movie_locations.dat', encoding='cp1251', index_col='movieID')
movie_locations.head()

        location1         location2    location3   location4
movieID
1             NaN               NaN          NaN         NaN
2          Canada  British Columbia          NaN         NaN
2          Canada  British Columbia        Delta         NaN
2          Canada  British Columbia        Delta  Tsawwassen
2          Canada  British Columbia  Maple Ridge         NaN

In [17]:
movie_locations.to_sql('movie_locations', engine)

In [18]:
movie_tags = pd.read_table('data/movie_tags.dat', encoding='cp1251', index_col=['movieID', 'tagID'])
movie_tags.head()

               tagWeight
movieID tagID
1       7              1
        13             3
        25             3
        55             3
        60             1

In [19]:
movie_tags.to_sql('movie_tags', engine)

# Tags

In [20]:
tags = pd.read_table('data/tags.dat', encoding='cp1251', index_col='id')
tags.head()

      value
id
1     earth
2    police
3    boxing
4   painter
5     whale

In [21]:
tags.to_sql('tags', engine)

In [22]:
user_rated_movies = pd.read_table('data/user_ratedmovies.dat', encoding='cp1251', index_col=['userID', 'movieID'])
user_rated_movies.head()

                rating  date_day  date_month  date_year  date_hour  \
userID movieID
75     3           1.0        29          10       2006         23
       32          4.5        29          10       2006         23
       110         4.0        29          10       2006         23
       160         2.0        29          10       2006         23
       163         4.0        29          10       2006         23

                date_minute  date_second
userID movieID
75     3                 17           16
       32                23           44
       110               30            8
       160               16           52
       163               29           30

In [23]:
user_rated_movies.to_sql('user_rated_movies', engine)

In [25]:
user_rated_movies_timestamps = \
    pd.read_table('data/user_ratedmovies-timestamps.dat', encoding='cp1251', index_col=['userID', 'movieID'])
user_rated_movies_timestamps.head()

                rating      timestamp
userID movieID
75     3           1.0  1162160236000
       32          4.5  1162160624000
       110         4.0  1162161008000
       160         2.0  1162160212000
       163         4.0  1162160970000

In [26]:
user_rated_movies_timestamps.to_sql('user_rated_movies_timestamps', engine)

In [27]:
user_tagged_movies = \
    pd.read_table('data/user_taggedmovies.dat', encoding='cp1251', index_col=['userID', 'movieID', 'tagID'])
user_tagged_movies.head()

                      date_day  date_month  date_year  date_hour  date_minute  \
userID movieID tagID
75     353     5290         29          10       2006         23           20
78     4223    5264         16           4       2007          4           43
127    1343    1544         28           8       2007          3           42
               12330        28           8       2007          3           42
       2080    1451         28           8       2007          3           42

                      date_second
userID movieID tagID
75     353     5290            15
78     4223    5264            45
127    1343    1544            27
               12330           27
       2080    1451            47

In [28]:
user_tagged_movies.to_sql('user_tagged_movies', engine)

In [29]:
user_tagged_movies_timestamps = \
    pd.read_table('data/user_taggedmovies-timestamps.dat', encoding='cp1251', index_col=['userID', 'movieID', 'tagID'])
user_tagged_movies_timestamps.head()

                          timestamp
userID movieID tagID
75     353     5290   1162160415000
78     4223    5264   1176691425000
127    1343    1544   1188265347000
               12330  1188265347000
       2080    1451   1188265367000

In [30]:
user_tagged_movies_timestamps.to_sql('user_tagged_movies_timestamps', engine)